// pages/agreement/agreement.js
Page({
  data: {
    agreement: [{
      tit: "“爱点”用户协议",
      msg: ["“爱点智慧餐饮平台”小程序（以下简称“爱点”）是由山西大集方圆科技有限公司（以下简称“大集方圆”）独立开发、运营的电子商务平台。",
        "本公司在此特别提醒用户认真阅读、充分理解本协议各条款，特别是其中所涉及的免除、限制本公司责任的条款、对用户权利限制条款、争议解决和法律适用等。请用户审慎阅读并选择接受或不接受本协议（未成年人应在监护人陪同下阅读）。除非用户接受本协议所有条款，否则用户无权使用本公司于本协议下所提供的服务。用户使用“爱点”或修改个人信息，即表示用户完全接受本协议的全部条款，并同意接受其约束。本协议适用于“爱点”的用户（以下简称“用户”、“您”），若您使用“爱点”（包括但不限于以任何形式接通、进入，或者使用“爱点”的各项服务、功能等），您的使用行为将被视为对本用户协议全部内容的知晓、认可并同意遵守。"],
      itemCont: [
        {
          itemTit: "1.接受",
          itemList: [
            "1.1 当您使用“爱点”时，您已经完全知晓、认可并同意遵守本协议中的条款选择访问或使用“爱点”有关服务，将视为同意接受本协议全部条款的约束。",
            "1.2 “爱点”有权在必要时更新本协议。我们保留对“爱点”结构、服务、功能等进行调整的权利。除非特别声明，新功能、新服务将适用本协议。无论本协议的每次更新还是服务内容调整，都会在“爱点”即刻发布，无需另行通知您并立即生效。如果您拒绝接受新的协议或者服务，您必须立即放弃使用“爱点”；若您继续使用“爱点”，则表明您已经完全知晓、认可并同意遵守新的协议或者服务除非另有明确规定，“爱点”所推出的新产品、新功能和新服务，均无条件的适用本协议。“爱点”保留在任何时候修改本协议条款的权利，且无需另行通知。用户在使用服务时应关注并遵守。"
          ]
        }, {
          itemTit: "2.用户",
          itemList: [
            "2.1 符合下列条件之一的个人、组织才能成为“爱点”的用户：",
            "2.1.1 是在中国大陆（含香港地区）依法设立、有效存续且产品合法的自然人、法人及其他组织。若您不具备此资格，请不要使用“爱点”。用户应当具备使用“爱点”和/或在“爱点”购买商品、享受服务的完全民事行为能力，并承诺对相关行为承担相应的法律责任。",
            "2.2 不具备上述资格的人不得成为“爱点”用户。本公司一经发现，有权立即注销该用户并“爱点”有权禁止被注销取消用户资格的自然人、法人及其他组织再次使用“爱点”。"
          ]
        }, {
          itemTit: "3.使用条款",
          itemList: [
            "3.1 使用“爱点”时，用户须遵守国家的法律法规和规章制度，遵守“爱点”有关协议、规定、规则、程序和惯例，不得利用“爱点”从事任何非法或不正当活动。用户不得在“爱点”发布各类违法或违规信息，包括但不限于商品信息、交易信息、商品留言、店铺留言，评价内容等。",
            "3.2 用户有权根据本协议的规定以及“爱点”发布的相关规则在“爱点”上购买商品、发表使用体验、参加各类活动，以及享受本提供的其他服务。",
            "3.3 “爱点”有权审核、发布或删除会员提交的信息。“爱点”将尽力核查会员提交的信息，但并不能完全保证信息的真实性、准确性和合法性，同时也不承担由此引至的任何法律责任。",
            "3.4 “爱点”含有与其他网站的链接。但并不能控制这些网站及其所提供的资源，对链接网站上的内容、广告、服务、产品信息的真实、准确、即时、完整性不做任何承诺，并且对链接网站不承担任何法律责任。",
            "3.5 用户同意，对于其上传到“爱点”的任何内容（包括但不限于文字、图片、视频），“爱点”具有免费的、永久的、不可撤销的、非独家的和完全的许可和再许可的权利，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品，传播、表演和展示前述内容（整体或部分），和/或将前述内容编入其他任何形式的作品、媒体、或技术中，不论是当前已知的或以后开发的。同时，用户同意“爱点”在未改变其提供信息的实质内容的情况下免于承担因该信息引发的任何法律责任。",
            "3.6 若用户违反本协议规定，或有违反国家及地方法律法规之行为，“爱点”有权停止传输并删除相关信息，屏蔽/禁止用户的发表、使用，如有必要可依法向相关主管部门进行披露。",
          ]
        },
        {
          itemTit: "4.纠纷、争议及投诉处理",
          itemList: [
            "4.1 用户在使用“爱点”的过程中，发现可能有侵害自己权利的事实时，应及时通知我们并提供相应的证明材料。因投诉不实给大集方圆或第三方造成损失的，应承担法律责任。",
            "4.2 “爱点”有权接受并处理用户间因使用“爱点”而产生的纠纷、争议及投诉，有权通过联系电话等方式了解情况、并将所了解的情况通过联系电话等方式通知对方。用户有义务在接通电话后，在指定的时间内提供相应的资料，配合纠纷、争议及投诉的情况了解与处理。对“爱点”的处理结果不满意的，用户可以依法向有管辖权的法院起诉。",
            "4.3 经生效法律文书确认用户存在违法或违反本协议行为或者我们自行判断会员涉嫌存在违法或违反本协议行为的，“爱点”有权公布用户的违法行为并做出相应处理，包括但不限于终止服务、永久禁止使用“爱点”等。",
          ]
        },
        {
          itemTit: "5.中止与终止",
          itemList: [
            "对于用户的以下行为，“爱点”有权在未告知的情况下中止或终止其相关服务或者拒绝其以任何形式使用“爱点”，并保留追究您法律责任的权利：",
            "5.1 用户同意，大集方圆有权随时对“爱点”的政策/或本协议做出变更；任何修改或者补充在其被张贴在“爱点”时立即生效，对双方都有约束力。重大变更将在“爱点”首页页面提示。用户继续适用“爱点”、购买商品、享受服务的，即视为对该等变更之确认。",
            "①用户违反本协议规定；",
            "②按照行政机关和/或授权职能部门的要求；",
            "③其他“爱点”认为需终止服务的情况。",
            "5.2 如发生下列任何一种情形，“爱点”有权无需通知而随时停止向用户提供服务：",
            "5.3 利用“爱点”滥发重复信息，发布国家法律法规等禁止或限制发布的信息，发布不属于会员经营范围的信息，或与“爱点”服务无关的信息；",
            "5.4 冒用其他企业的名义发布商业信息，进行商业活动；",
            "5.5 计划破坏、攻击“爱点”电脑系统、网络的完整性，或者试图擅自进入“爱点”电脑系统、网络；",
            "5.6 使用或提供含有毁坏、干扰、截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、定时程序炸弹或其他破坏性程序；",
            "5.7 盗用他人在“爱点”上的个人信息；未经我们同意出售或授权使用行为；通过或从事涉及网站的欺诈活动；通过或从事涉及网站的知识产权侵权行为；",
            "5.8 违反国家法律法规、规章制度、有关协议、规定、规则、程序和惯例的其他行为；",
            "5.9本协议终止或更新时，用户未确认新的协议的；",
            "5.10其他本公司认为需终止服务的情况。",
          ]
        },
        {
          itemTit: "6.责任声明",
          itemList: [
            "6.1 鉴于网络服务的特殊性，我们不对除基本安全、稳定以外其他的外部干扰、黑客攻击等因素造成的用户与网络服务器之间的连接受阻而无法访问负责。用户同意自己承担因“爱点”意外中断、操作或传输的迟延、手机病毒、网络连接故障、未经授权的进入等引起的损失。",
            "6.2 因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本合同所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其他自然或人为造成的灾难等客观情况。",
            "6.3 我们无法保证网络信息服务的准确性，对用户因使用“爱点”而造成的损失不负法律责任。用户可通过“爱点”有关服务获得第三方的某些内容或通往第三方网站的链接，但不代表我们与这些第三方有任何关系。第三方的网站均有各经营者自行负责，不属于我们控制及负责范围之内。对于存在或来源于此类网站或资源的任何内容、广告、产品或其他资料，我们对此不作保证、不承担任何责任、也不负有任何义务。用户对此自行加以判断，并承担因使用该等内容而引起的所有风险，包括但不限于因对内容的正确性、完整性活实用性的依赖而产生的风险。",
            "6.4 用户明确同意其使用“爱点”服务所存在的风险及其后果将完全由其自己承担，我们对用户不承担任何责任。如因用户违反有关法律、法规或本协议项下的任何条款而给大集方圆或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。",
          ]
        },
        {
          itemTit: "7.知识产权",
          itemList: [
            "7.1 “爱点”及“爱点”所有内容的选材、整理、排版、汇编，以及“爱点”创作的文字、图片等作品的著作权，无论是否明示，均属大集方圆所有。任何自然人、法人及其他组织未经我们书面授权或许可，不得修改、出版、传播、参与传播、销售、制作衍生作品，或以其他任何方式使用整体或部分的“爱点”上的内容，包括但不限于公司信息、产品信息，我们将保留追究其法律责任的权利。",
            "7.2 未经大集方圆授权，任何人不得使用“爱点”任何商标、服务标记、标识、域名和其他显著品牌特征的权利。",
            "7.3 “爱点”及“爱点”所有内容均受《中华人民共和国制作权法》、《中华人民共和国商标法》等的法律保护。用户在“爱点”上发布的信息不得侵犯任何第三人的知识产权，未经相关权利人之事先书面同意，用户不得以任何方式上传、发布、修改、传播或复制任何受著作权保护的材料、商标或属于其他人的专有信息。",
          ]
        },
        {
          itemTit: "8.法律适用及管辖",
          itemList: [
            "8.1 本协议的订立、变更、执行和解释及争议的解决，均应适用中华人民共和国法律。如与本协议有关的某一特定事项缺乏明确法律规定，则应参照通用的国际商业惯例和行业惯例。",
            "8.2 因本协议内容或其执行发生争议，双方应友好协商解决；协商不成时，任何一方均可向公司经营所在地的人民法院提起诉讼。",
          ]
        },
        {
          itemTit: "9.其他",
          itemList: [
            "9.1 用户使用“爱点”相关服务时，亦应知晓、认可并同意遵守相关服务的额外条款及条件。",
            "9.2 如本协议中的任何条款无论因何中原因完全或部分无效或不具备有执行力，本协议的其余条款仍应有效并且有约束力。",
            "9.3 本协议之条款是可分割的，任何协议条款被认定为无效或不可执行时，不影响其他条款之效力。",
          ]
        },
      ]
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function (res) {
    if (res.from === 'menu') {
      // 来自页面内转发按钮
      console.log(res.target)
    }
    return {
      title: '爱点自助点餐',
      path: 'pages/index/index',
      imageUrl: "/images/message.png",
      success: function (res) {
        // 转发成功
        // console.log(res)
      },
      fail: function (res) {
        // 转发失败
      }
    }
  }
})