// pages/legalNotices/legalNotices.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    notices:[{
      tit:"法律声明",
      msg: ["“爱点智慧餐饮平台”（以下简称“爱点”或“平台”）提醒您：在您使用爱点的各项服务前，请您务必仔细阅读并透彻理解本声明。如果您使用“爱点”，您的行为将被视为对本声明全部内容的认可。如对本声明内容有任何疑问，您可向平台客服咨询。",
     " 阅读本声明的过程中，如果您不同意本声明或其中任何内容，您应立即停止使用平台服务。"],
      itemCont: [
        {
          itemTit: "知识产权声明",          
        },{
        itemTit:"一、爱点知识产权",
        itemList: [
          "“爱点”所有的产品、技术与所有程序均属于“爱点”知识产权，为山西大集方圆科技有限公司及其允可的关联公司所有和使用。“爱点”公司独立拥有或与相关内容提供者共同拥有“爱点”站内相关内容（包括但不限于文字、图片、音频、视频资料及页面设计、编排、软件等）的版权和/或其他相关知识产权。“aidian”、“爱点”、“爱点”及“aidian”组合图标、标识以及本公司依法申请注册并具有商标专用权的商标均为注册商标，受中国法律保护。。",
          "除非中国法律另有规定，未经“爱点”公司书面许可，对于“爱点”公司拥有版权和/或其他知识产权的任何内容，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用。否则，“爱点”公司将依法追究法律责任。"
        ]
        }, {
          itemTit: "二、用户知识产权",
          itemList: [
            "任何用户接受《爱点用户协议》，即表明该用户主动将其在“爱点”发表的任何形式的信息的著作财产权，包括并不限于：复制权、发行权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给“爱点”的运营商所有，同时表明该用户许可“爱点”有权利就任何主体侵权而单独提起诉讼，并获得全部赔偿。 本协议已经构成《著作权法》第二十五条所规定的书面协议，其效力及于用户在“爱点”发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。",
           "用户同意并明确了解上述条款，不将已发表于“爱点”的信息，以任何形式发布或授权其它网站（及媒体）使用。同时，用户保证己放在“爱点”上发布的一切图文信息资料均具有完全知识产权和合法权利，不侵犯任何人人身或财产等一切合法权利。",
           "除非另行声明，平台内的所有产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利，均归平台或其关联公司所有。未经平台许可，任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载）。"
          ]
        }, {
          itemTit: "三、使用许可",
          itemList: [
            "未经山西大集方圆科技有限公司的明确书面许可，任何单位或个人不得以任何方式，以任何文字作全部和局部复制、转载、引用和链接。否则山西大集方圆科技有限公司将追究其法律责任。"          
          ]
        },
        {
          itemTit: "作弊检测",
          itemList: [
            "若“爱点”通过技术检测、人工抽检等手段有合理理由怀疑用户资料信息为错误、不实、失效或不完整，本平台有权暂停或终止用户的账号，并拒绝现在或将来使用本平台网络服务的全部或部分，同时保留追索用户不当得利返还的权利。"
          ]
        },
      ]
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})